//igra Slagalica

function igraPocinje()  {


let svaSlova=document.querySelectorAll(".slovo");

//prva grupa slova

let slova1=["а","р","а","м","а","с","к","д","а","б","а","с"];
let tacnaResenja1=[

"ар","ара","рам","ма","даска","даскама","да","сад","сада",
"даска","када","маска","самба","амбасада","са","кад","бас","сарма",
"карма","мада","бара","ада","марка","драма","бар","дабар","даса",
"срам","мрак","кадар","маскарада","брада","дама","ра","ка","барака",
"барка","сам","сама","маса","маскара"

];

let slova2=["б","а","а","а","с","д","о","л","ј","и","п","р"];
let tacnaResenja2=[

"бас","бара","сад","сада","под","рода","продаја","робија","добија","сабира",
"пробија","брод","дроби","сапира","сабирао","сапирао","брада","број","одбија",
"проси","бор","лија","распад","распада","пад","пада","прија","пријао","сабија",
"сабијао","испод","са","ас","ра","рад","рај","паб","дира","дирао","дирај","одаја",
"при","ораси","роса","прода","продај","сода","проба","проја","со","дабар","бар","ради",
"прасад","радио","добио","просио","спори","боса","лос","роди","ада","ара","доји","дојила",
"ла","род","добар","полиса","спој","споји","спојила","просила","соли","соба","бос","поји",
"сади","добра","садио","расипа","расипај","просидба","одбија","па","рапсодија","посади","посада",
"собар"

];


let slova3=["о","к","б","р","о","ј","е","р","п","н","а","љ"];
let tacnaResenja3=[

"око","број","јок","рок","роб","рој","рано","раној","роба","кора","корен","преко"
,"пророк","пена","онако","бројне","бројна","бројке","бројка","најбоље","напорно","напорне","бој","боље",
,"боља","бољој","копље","пребројао","поље","поља","проја","кобра","брак","пољане","небо","бр","набој","реп","репна",
"рај","рак","коре","рен","паб","пар","парне","коље","неко","краљ","кран","бљак","боје","боја","бојна","бојно","бојне",
"опране","бакље","опако","опак","опаке","ребро","ребра","репа","река","ко","непар","он","она","оно","оне","нека"
,"копно","копна","ок","прекобројан","прекобројна","ра","ера","покорена","покорен","напор"

];


let slova4=["з","о","т","м","в","о","а","н","д","и","ћ","с"];
let tacnaResenja4=[

"домаћин","дан","син","во","сова","мост","дани","дивно","дим","димна","вода","воћна",
"моћна","моћно","воћно","доћи","звати","зид","зидни","зидови","стан","мостови","сан","снови",
"нови","ови","дом","мода","модна","доста","синови","моћ","ноћ","ноћно","нова","ново",
"моћи","зона","звона","звоно","вино","ован","воз","возни","знати","ти","зна","на",
"ћи","сам","сами","мина","маст","масно","домаћинство","мото","свота","зоо","сто",
"оставио","дато","сом","сода","вид","води","див","доста","син","сида","сади","дани","отима",
"отимао","сади","новост","новости","сомовина","вино","зидно","мото","дисао","дознао","мина",
"маст","масти","син","синова","дно","мито","носи","носиво","носива","видно","дна","соба","сатови",
"дива","вади","затим","битан","битно","воз","зов","доза","возни","виза","монаси","зна","дозивао",
"назив","зима","домовина","озон","номад","номади","нос","наводи","синоћ","мати","сиво","сива","инат",
"иста","исто","одан","одани","вози","сито","сит","овас","он","они","она","овамо","онамо","остани","осмина",
"осми","осма","осмо","осим","одавно","стони","мио","смотан","смотано","смотани","тона","нотар","ноћи","ниво",
"дозива","мота","снаћи","сво","сва","сватови","знао","оса","ово","ови","ова","осовина","остави","сита","ситан",
"ситно","тонови","оснива","оснивао","возим","возимо","тим","дизна","низ","низови","зова","смоћи","мит"

];


let slova5=["з","х","р","а","е","ј","м","о","н","њ","и","a"];
let tacnaResenja5=[

"храм","монах","море","рај","знање","зној","рам","рој","ној","херој","занимање","зона",
"мање","харизма","зар","иза","раме","роман","романи","имање","има","разна","разно","разне","зна"
,"размена","измена","намера","змај","мраз","замор","он","она","они",
,"оне","занимао","занима","мој","моја","моји","моје","монархија","ја","ти","ми","ар","армија","ера","мени",
"мера","хармоније","хармонија","хром","арома","рони","змија","замена","иза","најмање","низ","рамена","рима",
"риме","мени","мери","мраз","јаре","мина","мине","мизеран","мрзи","зима","имање","име","имена","арена","армија",
"армије","анемија","рани","море","мора","морање","знање","химна","хир","немар","мања","имања","ранија","рана","мирно",
"мирна","мирне","реми","замера","мираз","мане","мана","земни","мир","мој","моја","моје","моји","намерио","знање","мери",
"мизерија","орање","оран","орни","орне","мањи","мањина","мањине","мерио","зора","зоре","замери","замори","зима","зиме",
"мерни","мењани","зајам","нем","нема","неми","рањени","ране","реза","резања","морање","иронија","ироније","нај","ној","норма",
"заморна","орна","орне","орни","немир","ранија","раније","зној","знојна","знојне","рам","хемија","миран","змије","зоне","харем",
"хареми"

];

let slova6=["т","п","п","е","е","и","и","х","а","р","ј","м"];
let tacnaResenja6=[

"пета","пет","пети","храм","рам","прети","мапе","репа","премија","тепих","јаме","материја",
"хемија","пита","реп","пите","репе","раме","армије","тапети","империја","ја","ми","ти",
"јер","прах","мир","метар","метри","рај","хартије","папир","папири","партије","при","па",
"хир","прија","траје","перипетија","три","тих","хит","хитар","хитра","мери","махер","рат",
"ремети","трема","пере","пре","пихтије","мера","пех","реми","аритмије","мерити","хитрије","хемије",
"пра","март","харем","рате","мета","мај","примети","јаре","пар","паре","пате","мит","тим","перипетија",
"пехар","рима","архи","арија","ера","прати","пратим","прети","тиха","тихе","пире","паре","памет","прими",
"премије","пете","хареми","примите","примети","пити","питај","пех","пре","претим"

];


let slova7=["ц","о","н","н","а","а","а","ј","х","р","и","л"];

let tacnaResenja7=[

"нација","рација","храна","хир","рај","нај","он","она","онај","хор","ној","лија",
"лој","хир","рана","раној","ранија","оран","орна","архи","хранилица","лица","храни",
,"арија","нар","на","ја","ли","орни","они","анални","анално","лани","ало","ла","хало"
,"али","нана","лонац",,"хранилац","ланац","лан","царина","ах","их","ланци","лонци","аналној"
,"цар","рано","ранац","орални","орална","оралнија","нахранио","нахранила","ронилац","иронија",
"хранио","нарација","јахао","јао","ронила","хранила","рационална","анархија","црно","црна","црнија",
"оцрнила","ара","ар","орнија","лојна","црн","налио","рони","ролна","аналнија","лира",

];

let slova8=["м","т","р","а","з","а","е","и","м","а","к","с"];
let tacnaResenja8=[

"рат","рам","рата","рате","раме","рима","раса","камера","крем","марама",
"сарма","сам","сама","сами","саме","са","смак","мак","ма","маза",
"замера","мера","затим","тим","три","аматер","тера","стар","стари","старим",
"сматра","тераса","трема","замара","смер","смера","иза","иста","за","маса",
"каса","сат","сати","сатира","сир","зима","има","стаза","заиста","тама",
"зар","мета","стазе","касе","расе","масе","тема","аматери","сатима","траса","стара",
"метар","исте","миксер","ким","истера","истерам","карма","казати","ти","рака","расте","раст","реза",
"трака","траке","месар","месари","масер","масери","искра","краси","мази","астма","криза",
"кризе","красе","маска","маске","маскара","маст","масти","места","замка","замке",
"крема","креста","искре","замак","кремаста","крст","скрати","замерка","мазати","теза","такса","таксе","такси",
"скрате","зимска","камата","камате","тимска","тимске","зрак","таксира","таксирам","срам","старке","стрика","стрике",
"кер","секира","касета","карме","сарме","мрак","мраз","кист","река","ремикс","резати","мараме","размак","кез","зека",
"раке","зимске","зарасте","аматеризам","атак","скита","кит","мит","трик","зиме","мери","рика","кари","ар","ара","акт","акти",
"тик","мир","рис","макси","иметак","рак","марксизам","марка","марке","израсте","треска","меки","мека","мек","микс","икс","ракета",
,"замаскира","аматерска","мрзи","мрзим","маказе","макета","маркет","маркети","касир","секта","актер","маме","мама","мираз","маскира",
"тесар","ритам","сита","смрт","мрска","мрски","мрске","трска","мрки","мрке","мрка","трка","трке","трза","карте","карта","карате",
"метак","малтер","име","ера","трасе","траса"

];

let slova9=["м","a","џ","с","г","о","н","а","л","р","т","е"];
let tacnaResenja9=[

"маст","тема","рат","раст","нога","ноге","трема","тег","сат","траг",
"талог","орман","мета","метла","налог","лагано","лаган","метар","мера","места","месар","масер",
"трема","трасе","раме","орна","орне","трн","тама","трг","село","села","смог","рог","гранате","лом",
"мана","мане","мало","мала","мале","масно","грло","грла","малено","малена","остала","остале","галаме",
"рате","рата","маленог","нестала","нестало","нега","лан","тераса","тела","тело","сено","рано","реално",
"реална","ратно","реалног","ролна","ране","рана","мана","мане","саме","сама","сала","сале","сало","мост",
"слан","слано","сто","снага","снаге","лос","срна","лојна","егал","мотре","стрела","стално","стална","слога",
"лане","мој","моја","моје","тамно","тамне","тамна","тамног","малтер","смрт","смртно","смртног","стар","старо","старе",
"стара","расно","расна","роса","нота","ноте","тон","он","она","оне","магла","магле","роман","ролне","нето","тоне","тона",
"метро","рт","ранг","грана","гране","гром","морал","морална","моралне","танго","самба","гол","гост","море","мора","трома",
"трола","месна","растегла","орална","отеран","отерана","тог","мог","ран","џем","метално","метална","метал","тесар","намера",
"стена","стане","олтар","орган","голман","трон","налет","мотел","норма","рамена","рента","лента","март","горе","тесна","тесно",
"сонат","картел","гест","гора","нестао","нестала","але","ала","атлета","нагост","немар","настале","атом","монета","нос","носе",
"гоне","го","наг","сломе","ген","наге","лет","многа","многе","снег","смер","стан","ролат","трне","талон","моле","голе","мерна",
"расне","метлао","смена","лама","гас","гасна","гасно","маестрално","таман","малер","его","станар","столар","стрма","аларм","нас",
"манго","термална","термално","термо","тамо","молер","анале","али","има","те","млате","салате","монтер","ласер","стао","ера","нем","нема"
,"рен","грана","гране","масно","масне","масна","маестрално"

];

let slova10=["т","в","о","в","о","ч","н","а","ч","е","с","ш"];
let tacnaResenja10=[

"во","честа","често","част","часте","часно","часна","стена","шеста","вече","веће",
"већа","вечна","вечно","вечност","света","свето","начета","ново","нова","ноша","нето",
"свечано","шансе","што","то","шета","носе","нове","течна","течно","тесна","тесно","стан","стане",
"вест","чета","вешт","ташне","тоне","тона","нос","освета","сто","шесто","вена","нов","ован","свота",
"своте","оставе","точена","точено","сено","час","сова","сове","свет","оса","осе","сан","точе","став",
"начет","сочна","сочне","свечане","сат","тен","он","она","оне","носач","начета","воштане","чесна","савет",
"нота","ноте","нотес","нестао","нестало","снео","снета","насео","тачно","тачне","овас","очас","сав","сво",
"вешта","вешто","шта","вате","ват","сеча","ено","ван","ето","шета","шетач","шетао","санте","сточна","сточне",
"ваше","ваш","сонате","шав","очна","очне","сетва","сотоне","тв","венчао","чет","четовао","стао","сонат","наше","наш",
"со","новост","станове","та","не","човечанство"

];

let slova11=["м","е","н","п","а","њ","н","а","р","е","л","и"];
let tacnaResenja11=[

"планина","планине","прање","пламен","лане","раме","рамена","пар","парне","парна","непарна",
"непарне","непар","немар","немарна","мање","пена","пене","план","племена","лепа",
"лепо","леп","племе","реп","репна","репне","пањ","лења","лењ","лење","рели",
"плени","плен","пале","пали","пала","имање","има","имања","мањи","мери","реми",
"планирање","плане","пени","арена","арене","плин","плима","плиме","намерна","рамени",
"ара","ар","премали","напне","примање","примања","прима","немање","имена","име","риме","рима",
"нар","ималин","пари","млин","рани","ране","рана","мир","мирна","мирне","мења","мењали","мењале",
"мењала","имела","лимена","лимене","лимен","плане","немир","према","проли","рањени","рањена","рањене",
"примена","приме","мерења","мине","пиле","мана","мане","неми","мина","минерал","минералне","малина",
"малине","пралине","пралина","при","мерила","мериле","мирење","лире","анале","принела","рен",
"пила","липа","лепи","липе","пара","паре","малени","малене","малена","мален","планинарење","мењан","мењана",
"мењани","прамен","пире","на","па","плинара","немирне","немирна","линеарна","линеарне","реалне","реална","нереалан",
"пелена","панел","раниле","ранила","мерена","мерен","пламени","преламање","мањина","мањине","наменила","пењали","пењала",
"пењале","ера","прале","прали","прала","пенал","пенали","пренели","пренела","напели","напела","напели","напали","напале",
"пране","прана","прани","лењир","премала","премале","малер","малери","нем","нема","минерална","лимар","лим","мали","пламена",
"мапа","елем","репе","мени","пра","пилана","миран","амин"

];

let slova12=["ш","м","л","р","а","ј","и","а","н","и","и","е"];

let reci1=[11,12,13,14,15,16,17,18,19,20,21,22];
let tacnaResenja12=[

"машина","мешана","мешан","мешани","машине","машне","машна","јама","јаме",
"мина","мине","шара","шаре","шарена","шарени","шема","шине","шина","мени",
"име","имена","реми","рај","рима","риме","реш","манија","манири","немар","млин",
"мане","мана","рана","ране","рани","арена","нај","малени","малена","мален","маларија",
"армија","армије","линија","линије","аларм","мали","мале","мала","ранија","лим","лимена","лимени",
"анемија","ала","рам","раме","рамени","рамена","лира","лане","лама","анимира","лија","малиша","шири",
"шире","шира","анале","најшире","најшира","најшири","мир","мири","мире","мира","немири","немир","намерна",
,"намерни","намера","алеја","маше","леш","шала","шале","шије","шила","шиле","рели","мирне","минерали","минерал",
"шал","мерна","мерни","шаран","шарани","раније","малер","малери","шарам","мерили","мерила","тишина","тишине","метла",
"метар","метри","имела","неми","нема","шамар","шамари","мирише","лешинар","лешинари","малина","малине","малинар","малинари",
"нас","наши","наш","наше","миран","шинама","неман","але","млинари","млинар","мирнија","мирније","аларми","напиле","напила",
"ја","ми","ли","јаше","рен","али","шета","шетач","нишан","нишани","але","минира","мени","имена","име","реши","машинерија"

];


// druga grupa reci


let slova13=["ч","а","у","а","т","м","о","а","п","ј","с","и"];
let tacnaResenja13=[

"ауто","аута","пасија","сат","сати","сија","моја","моча","мој",
"писма","писмо","туп","писта","тупи","иста","пост","пости","пита",
"мост","ми","мит","мота","мито","мути","сипа","пси","пусто","пусти",
"чита","читај","чупа","чупати","чипс","питома","питом","пустио","тим",
"аут","супа","топ","топи","иста","аутом","исто","ритам","рима","паста",
"чиста","почасти","пачија","јача","мач","сом","пут","чип","питај","осип",
"сами","сам","сама","опасти","појам","маст","стапају","стапа","јачи","астма",
"сатима","армија","аутима","устај","остаја","маса","мај","мапа","спој","споји",
"чија","ступио","стиче","опустим","сипај","пати","патимо","опија","томпуси","томпус",
"спаја","осам","осма","мач","утопија","пасја","маст","масти","аутопсија"

];

let slova14=["м","к","у","е","к","ж","о","н","т","а","р","п"];
let tacnaResenja14=[

"кум","кума","муке","мука","жена","нож","пар","парно","монтаже",
"преко","прано","пране","нотар","тон","мотка","мрежа","метар","контра",
"кука","рука","ружа","потражено","тоне","журка","журке","патке","рате",
"жар","жарко","круже","круна","руже","руке","куне","куна","прека","мерка",
"мрак","траке","пружа","прате","према","мане","према","куке","тражен","трн",
"трка","трке","тона","прамен","трон","трпа","крпа","трпе","крпе","промена",
"монета","пуко","жена","пра","раме","рак","ране","питка","питке","пита","пите",
"примена","три","тим","тиме","нотар","рента","трема","тужен","тужена","опружена",
"пружена","ружан","ружна","ружне","ружно","камен","прут","мотка","мотке","жарке","прао",
"промена","рат","рампе","корен","кора","коре","румен","румена","румено","рум","руж","тумор",
"умор","умро","мокра","мокар","карме","тампон","укопан","копан","пун","пуна","пуне","уморна",
"уморне","множе","умотан","умотане","нота","ноте","кома","коме","кожа","коже","кожна","кожне",
"журе","тмурна","тмурно","тужан","тужно","тужне","тужна","жут","жуто","жута","путна","путно",
"нумера","помера","потера","репа","помаже","пантер","крупан","крупно","крупне","купа","рута",
"прут","крут","напор","норме","питома","питоме","роман","рупа","рупе","туре","парне","патке","пак",
"крута","круте","труне","туна","мутан","мутно","мутне","муж","топ","мек","мека","река","рок","ратне",
"карте","он","она","оне","пума","пуме","ракун","марке","маркет","корпе","корпа","капе","танко","танке",
"танкер","оран","орна","орне","рукомет","рукометна","руком","опна","опне","ремонт","уморан","крупне","крупно",
"пуж","таме","мерка","тупан","траке","ауто","паркет","упоран","упорне","ретко","ретка","мекан","макета","акт",
"метак","петак","крема","покаже","промет","прометна","раж","ракета","трен","кран","кратке","пукне","жарке","памет",
"паметна","орман","кратко","нокат","пре","прек","матор","жупан","пакер","пекар","мапе","темпо","петна","репат","режао",
"пакт","жетон","актер","монтер","арт","морж","троме","трома","ароме","аеро","перо","пера","претим","претимо","укор",
"откуп","так","кнап","мукотрпан","мукотрпна"

];

let slova15=["с","т","е","с","л","о","е","н","к","в","т","и"];
let tacnaResenja15=[

"сто","вест","вести","весло","свиње","свиле","свилене","тикве","тен","слети",
"кит","инсекти","тело","слике","кисело","слине","силне","нето","ниво","тенк",
"витке","слон","склоне","тенкови","клетве","словне","слетео","телетина","теле",
"лов","волети","лево","весело","силовите","нити","кити","ките","ево","ноте","леве",
"леви","село","осветник","светлост","светло","светле","телесно","телесне","стеко",
"текстил","текстилно","текстилне","ето","витко","вине","вино","кивне","кине","кивно",
"секте","селективно","селективност","ткиво","вотке","свети","свете","текст","текстови",
"исте","исто","кисне","естетски","тонске","тоне","слете","лете","лети","лето","скине",
"освете","сиве","сиво","откине","отекло","отекле","кист","летве","лик","тест","тестови",
"стене","истекло","истекле","текло","текли","ситне","ситно","кости","кост","неки","неко",
"нове","нови","нокти","тикет","сви","виткост","во","виле","висе","стекни","стекне","исток",
"векне","ков","инсект","свеске","свет","светске","светски","свети","свете","тло","ток",
"снео","свесни","свесно","свесне","кестен","кестени","син","синове","сенке","свести",
"истоветне","сести","селе","тесне","тесни","тесно","тв","сети","сетио","осети","тост",
"тенис","вентил","теле"

];

let slova16=["н","н","е","е","о","о","л","в","р","т","в","а"];
let tacnaResenja16=[

"врт","трн","вео","ватрено","ватре","лаве","лов","тело","тела","врела",
"он","вретено","вретена","лево","лева","леве","ране","рано","арене","воле",
"ветар","оверен","оверена","оверено","равно","равне","отворена","отворене",
"летве","летва","лето","лета","лете","тоне","тона","нето","твор","врат","вратне",
"рента","ренте","антене","ован","отрован","отровне","терен","оловне","оловна","неверна","неверно","неверан","веран",
"верна","отров","рат","ратно","ратна","верена","он","оне","она","оно","нове","нова","ново",
"лента","ленте","роне","вате","ван","отвор","отворе","верно","налет","релевантно","рен","ретко",
"ретка","ретке","ролне","ролна","ролат","отела","отеле","отело","лавор","лаве","лове","лова","ратовао",
"ратовале","неотворене","неотворена","вена","вене","роловане","ролован","реално","реалне","ноте",
"нота","олтар","лото","трен","теле","товатне","неотровне","неотровна","неотрован","револт","врело","врела",
"вреле","врте","ловор","ореол","орне","орна","орно","ларве","вртео","вртела","навео","налет","налете","варена",
"варене","оралне","орално","eрa","отео","вероватно","вероватне","троване","тровано","товаре","овера","овере","врео",
"трол","невероватно"

];


let slova17=["а","м","г","а","р","р","и","у","к","т","у","л"];
let tacnaResenja17=[

"рам","рима","култура","култ","гитара","лук","кула","река","рата",
"рат","тим","три","трик","лик","марка","ритам","рак","март","аларм",
"аларми","ратар","три","галами","матира","рака","карма","лука","тура",
"тик","кит","тама","гуркали","мала","мали","игра","играм","мука","рука",
"рукама","рута","гулим","кум","кума","карта","маркира","гутали","гули",
"гура","гурам","клати","карта","карат","мир","мулти","туга","руга","крали",
"тигар","гурати","ругати","лак","макар","млати","гуркати","гума","лутка",
"луткар","млака","лимар","лим","умутила","магла","маска","игла","кригла",
"ратлук","рика","тумара","ругали","куга","тла","акумулира","мутира","крати",
"лакат","акт","мусака","мулта","ара","лакати","лагати","млаки","грми","трг",
"клима","алат","алати","траг","марила","трагали","гатари","три","крала","тукли",
"тукла","трула","трули","тргали","тргала","лакира","лака","мула","кила","килт",
"глума","агрикултура"

];

let slova18=["т","р","е","е","р","т","о","м","р","а","и","з"];
let tacnaResenja18=[

"зима","зиме","три","замерио","мора","море","замор","третира",
"затим","зао","зора","зоре","трема","тема","метеор","метеори",
"мираз","матор","мир","амортизер","мраз","мера","мере","реза","мерак",
"ремети","ритам","зарате","рате","рата","мета","метар","резати","терети",
"март","мезе","тим","троме","трома","тром","морати","замера","метри",
"тремор","трезор","раме","мерите","ера","зар","резао","орати","мире","терма",
"теза","зрео","метро","мотре","тероризам"

];

let slova19=["д","и","и","р","н","к","с","н","а","е","т","з"];
let tacnaResenja19=[

"знати","крати","дати","дирати","креда","знак","зрак","криза",
"кризна","кредит","кредитна","дискретна","наредни","наредник",
"екстра","танке","ретка","ретки","траке","танки","скрати","истек",
"санке","река","кран","красте","искрена","искрени","истек","средина",
"среди","крема","радне","старке","старе","стари","рак","раке","теза",
"динар","среда","редна","расте","метак","кеса","касне","касни","расни",
"расне","рамени","дирка","дизати","дискета","диск","даске","зид",
"зидне","зидна","санке","санка","ризик","танкер","танкери","тенк",
"трик","дан","дани","седни","седа","крени","креста","рад","дрека","каде",
"радник","дрзак","крзна","зрна","зидар","тесна","тесни","тенис","стена",
"крст","дизне","дизна","низ","крсна","секта","зидате","садите","сат","сати",
"ситне","ситна","кеса","касе","касни","касне","седи","седни","скине",
"нектар","скрени","тазе","крда","раскине","сенка","саде","синдикат","акт",
"актер","крени","трска","трзне","сркне","срна","срне","десна","десни","син",
"трн","трке","трка","затекни","индискретан","индискретна","директан","директна",
"редак","зека","дека","низак","закине","кисне","накит","ракета",
"сита","тиска","таксе","такси","так","карат","санте","канте","секира","стар","дар","дира","кад",
"сека","стаде","тад","кез","истине","сад","седа","дасе","скенира"

];

let slova20=["и","ј","а","ц","н","е","к","у","р","н","о","к"];
let tacnaResenja20=[

"ко","он","они","она","нације","рука","руке","рације","рак","река",
"орка","круна","круне","цури","цура","цуре","кука","куке","не","цена",
"куне","куце","куца","јуне","реакције","море","мокре","мокра","море","мора",
"јаки","јаке","орни","орна","орне","окна","црн","црна","црне","корен","куне",
"цинк","црнка","црнке","јакне","крeнуо","куне","цуре","корице","корекција","кине",
"рецка","јаке","јаки","уцена","куцне","конци","конац","крај","крајни","крајне","нос",
"нејак","нејаки","јарке","круница","рујна","куцне","куцни","цео","цела","цели","јуре",
"јури","ајнц","мекан","мекани","меница","мек","мека","мине","мина","јаук","крајник","рај",
"унео","ранице","канцер","канцери","кренуо","кроји","рок","кроје","крије","крио","јаре",
"царине","цар","конекција","ракун","ракуни","унос","екран","екрани","кројено","кројена",
"раније","оцена","ценио","уценио","кроји","крије","кренуо","куцао","рок","рој","конкуренција"

];

let slova21=["т","у","н","т","и","р","н","в","и","т","с","о"];
let tacnaResenja21=[

"виси","исто","ту","врт","трн","врти","сто","створи","твор",
"орни","тост","три","трио","стотину","нови","носи","нос","врсни",
"ситно","ситни","сир","рис","сити","сит","снови","носити","вино",
"врсно","стони","трновит","осврни","тон","турити","осврнути","синути",
"свирнути","ниво","туристи","иструни","син","синови","труни","створ",
"отиснути","усни","истурио","трон","вирнути","трнови","створити","новитет",
"сo","вриснути","трнути","суво","суви","сиво","нутритивност"

];

let slova22=["ш","а","ј","и","ц","и","ц","к","у","л","х","џ"];
let tacnaResenja22=[

"циција","кула","лик","шал","лука","куцали","клица",
"јаки","јак","шах","џак","јул","лујка","киша","лија",
"цица","цицијашлук"

];

let slova23=["н","е","м","р","т","с","ц","а","у","а","ј","и"];
let tacnaResenja23=[

"смрт","смртни","места","тема","смера","неми","мера","мери",
"нема","стари","старим","старе","стреми","трема","трен","ситуација",
"тесар","месар","расте","растем","метар","метри","реми","ратни","сама","страни",
"стране","стриц","тераса","масер","трасе","траса","труне","семинар","румена",
"румени","тамне","рента","мистерија","старица","трајни","руте","рута","центар","стриц",
"смртна","смртне","санте","аута","стрма","мери","мир","мирна","мирне","мит","име","имена",
"стрми","ујна","струја","мајица","мајице","устаје","смета","трује","сума","сутра",
"сунце","истрајна","истрајне","јутра","мерни","мерна","мане","мана","маст","масне",
"масна","стрина","стрине","стрије","туна","суме","нације","нација","меница","семинар",
"трен","сумира","термин","мине","мина","тамније","тамнија","рујна","март","мај","јун",
"мутира","сат","сати","сија","цимер","туце","сумира","јама","јаме","јата","туне","туре",
"муцати","тајне","тајна","саме","сама","сами","мета","сатира","смејати","смерати","истеран",
"устаје","устајем","иста","исте","сирена","смирена","ратује","ратујем","смена","смета","арена",
"стена","цар","анемија","нумера","намера","ратне","рани","нотар","нотес","немар","станица","станице",
"стеница","снети","матира","матиран","матиране","ринте","ритам","смерница","смирен","мантија","ум",
"умни","умна","умна","тамнице","тамница","материја","турнеја","мутиран","снима","сниме","снимај","снимајте",
"рам","раме","рамени","рамена","нестају","сам","сан","трају","трну","рације","рација","серија","сир","миран",
"мирне","месна","ратнима","немати","амнестира","срце","срца","тенис","анти","менструација"

];

let slova24=["м","о","р","т","н","а","а","з","и","м","м","м"];
let tacnaResenja24=[

"роман","романи","мраз","мрзи","занима","занимао","арома",
"зима","мит","тим","мора","трн","рам","рата","тон","матор",
"мрзио","мрзим","на","орман","ормани","замени","тром","трома",
"троми","зна","знам","знати","матори","мази","мир","морати",
"тамо","он","она","они","рат","ратни","ритам","манир","рима",
"отиман","орни","орна","отима","мит","мито","миран","мирно",
"рани","рано","мрзим","зона","морам","зора","замор","мимо","мираз",
"зар","намера","намерио","заменио","разнати","затим","анти","ара",
"ар","мина","разни","разна","разним","разнима","романтизам"

];




function pravopisnaGreska() {

gramaticko.innerHTML="";

}

let gramaticko=document.querySelector(".gramatika");

function gramatickoResenje() {

for(let i=0; i < tacnaResenja1.length; i++)  {

if(recPoRec.innerHTML=="11" && covek.value==tacnaResenja1[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja2.length; i++)  {

if(recPoRec.innerHTML=="12" && covek.value==tacnaResenja2[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja3.length; i++)  {

if(recPoRec.innerHTML=="13" && covek.value==tacnaResenja3[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja4.length; i++)  {

if(recPoRec.innerHTML=="14" && covek.value==tacnaResenja4[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja5.length; i++)  {

if(recPoRec.innerHTML=="15" && covek.value==tacnaResenja5[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja6.length; i++)  {

if(recPoRec.innerHTML=="16" && covek.value==tacnaResenja6[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja7.length; i++)  {

if(recPoRec.innerHTML=="17" && covek.value==tacnaResenja7[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja8.length; i++)  {

if(recPoRec.innerHTML=="18" && covek.value==tacnaResenja8[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja9.length; i++)  {

if(recPoRec.innerHTML=="19" && covek.value==tacnaResenja9[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja10.length; i++)  {

if(recPoRec.innerHTML=="20" && covek.value==tacnaResenja10[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja11.length; i++)  {

if(recPoRec.innerHTML=="21" && covek.value==tacnaResenja11[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja12.length; i++)  {

if(recPoRec.innerHTML=="22" && covek.value==tacnaResenja12[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja13.length; i++)  {

if(recPoRec.innerHTML=="23" && covek.value==tacnaResenja13[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja14.length; i++)  {

if(recPoRec.innerHTML=="24" && covek.value==tacnaResenja14[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja15.length; i++)  {

if(recPoRec.innerHTML=="25" && covek.value==tacnaResenja15[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja16.length; i++)  {

if(recPoRec.innerHTML=="26" && covek.value==tacnaResenja16[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja17.length; i++)  {

if(recPoRec.innerHTML=="27" && covek.value==tacnaResenja17[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja18.length; i++)  {

if(recPoRec.innerHTML=="28" && covek.value==tacnaResenja18[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja19.length; i++)  {

if(recPoRec.innerHTML=="29" && covek.value==tacnaResenja19[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja20.length; i++)  {

if(recPoRec.innerHTML=="30" && covek.value==tacnaResenja20[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja21.length; i++)  {

if(recPoRec.innerHTML=="31" && covek.value==tacnaResenja21[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja22.length; i++)  {

if(recPoRec.innerHTML=="32" && covek.value==tacnaResenja22[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja23.length; i++)  {

if(recPoRec.innerHTML=="33" && covek.value==tacnaResenja23[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}

for(let i=0; i < tacnaResenja24.length; i++)  {

if(recPoRec.innerHTML=="34" && covek.value==tacnaResenja24[i]) {

gramaticko.innerHTML="РЕЧ ПРОНАЂЕНА";

  } 

}


}


let pc1=0;

let reci2=[23,24,25,26,27,28,23,30,31,32,33,34];

let recPoRec=document.querySelector(".reci");

function igraSlova1() {
	
recPoRec.innerHTML=reci1[Math.floor(Math.random()*reci1.length)];

if(recPoRec.innerHTML==="11")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova1[i];

   }

  }

if(recPoRec.innerHTML==="12")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova2[i];

   }

  }

if(recPoRec.innerHTML==="13")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova3[i];

   }

  }

if(recPoRec.innerHTML==="14")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova4[i];

   }

  }

if(recPoRec.innerHTML==="15")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova5[i];

   }

  }

if(recPoRec.innerHTML==="16")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova6[i];

   }

  }

if(recPoRec.innerHTML==="17")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova7[i];

   }

  }

if(recPoRec.innerHTML==="18")  {


for(let i=0; i < svaSlova.length; ++i)  {

svaSlova[i].innerHTML=slova8[i];

   }

  }

   if(recPoRec.innerHTML==="19")  {


   for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova9[i];

   }

  }

  if(recPoRec.innerHTML==="20")  {


   for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova10[i];

   }

  }

  if(recPoRec.innerHTML==="21")  {


   for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova11[i];

   }

  }

  if(recPoRec.innerHTML==="22")  {


   for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova12[i];

   }

  }

}

let igramoSlova=setInterval(igraSlova1, 10);

let slagalicaSat;

function zaustavi1() {
	
	clearInterval(igramoSlova);
	clearInterval(biranjeSlova);
	slagalicaSat=setInterval(alarm, 1000);
}

let biranjeSlova=setTimeout(zaustavi1, 1800);

let slagalica=document.querySelector(".slagalica");
let covekIgrac=document.querySelector(".COVEK");
let kompjuterIgrac=document.querySelector(".KOMPJUTER");

let stoperica=document.querySelector(".isteklo1");
let covek=document.querySelector(".covekResenje");
let covekovPotez=document.querySelector(".igrac1");
let ci;
let ci1;

let kompjuterovPotez=document.querySelector(".igrac2");
let kompjuter=document.querySelector(".kompjuterResenje");
let ai;
let ai1;

let prvaRunda25;
let drugaRunda5;
let trecaRunda;
let stop2;
let stop1;
let stop3;

function alarm() {
	
  stoperica.innerHTML -=1;

  if(stoperica.innerHTML < 1)  {

    clearInterval(slagalicaSat);
    covek.readOnly=true;
    prvaRunda25=setTimeout(covekVSkomp, 1500);
    algoritamKompjuteraSlagalica(); 
    stop2=setTimeout(menjanjeKolona, 3000);

    }
    
   if(stoperica.innerHTML < 10)  {

   $(stoperica).prepend(0);

    }

}

let gramatika;

$(".brisanje").click(function() {
$(".covekResenje").val("");
$(".covekResenje").removeClass("vokal");
$(".slovo").css("color","black");
gramaticko.innerHTML="";
cifra.innerHTML=0;

for(let i=0; i < svaSlova.length; i++)  {

svaSlova[i].addEventListener("click", pronadjenoSlovo);

  } 

});


for(let i=0; i < svaSlova.length; i++)  {

svaSlova[i].addEventListener("click", pronadjenoSlovo);

  } 

let cifra=document.querySelector(".racunanje");

function pronadjenoSlovo() {
  
let dod=parseInt(cifra.innerHTML);
cifra.innerHTML=dod+covek.value.charAt.length;

covek.value +=this.innerHTML;
this.removeEventListener("click", pronadjenoSlovo);
this.style.color="orange";

setTimeout(gramatickoResenje, 1500);

if(cifra.innerHTML==covek.value.length) {

setTimeout(pravopisnaGreska, 500);

}

if(this.innerHTML=="а" || this.innerHTML=="е" || this.innerHTML=="и" || this.innerHTML=="о" || this.innerHTML=="у") {

covek.classList.add("vokal");

 }

}

function covekVSkomp() {
	
  ci=parseInt(covekovPotez.innerHTML);
  ai=parseInt(kompjuterovPotez.innerHTML);

if(covek.value.length >= kompjuter.value.length && gramaticko.innerHTML=="РЕЧ ПРОНАЂЕНА") {

    covekovPotez.innerHTML=ci+covek.value.length;

    }  

if(kompjuter.value.length > covek.value.length)  {

  kompjuterovPotez.innerHTML=ai+kompjuter.value.length;

  }

}

function algoritamKompjuteraSlagalica() {
	
     if(recPoRec.innerHTML==="11") {

      kompjuter.value="маскарада";

     }

     if(recPoRec.innerHTML==="12") {

      kompjuter.value="рапсодија";

     }

     if(recPoRec.innerHTML==="13") {

      kompjuter.value="прекобројан";

     }

     if(recPoRec.innerHTML==="14") {

      kompjuter.value="домаћинство";

     }

    if(recPoRec.innerHTML==="15") {

      kompjuter.value="хармонија";

     }

     if(recPoRec.innerHTML==="16") {

      kompjuter.value="перипетија";

     }

      if(recPoRec.innerHTML==="17") {

      kompjuter.value="рационалан";

     }

     if(recPoRec.innerHTML==="18") {

      kompjuter.value="аматеризам";

     }

     if(recPoRec.innerHTML==="19") {

      kompjuter.value="маестрално";

     }

     if(recPoRec.innerHTML==="20") {

      kompjuter.value="човечанство";

     }

     if(recPoRec.innerHTML==="21") {

      kompjuter.value="планинарење";

     }

     if(recPoRec.innerHTML==="22") {

      kompjuter.value="машинерија";

     }

}



function igraSlova2() {
	
  recPoRec.innerHTML=reci2[Math.floor(Math.random()*reci2.length)];

  if(recPoRec.innerHTML==="23")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova13[i];

     }

  } 

    if(recPoRec.innerHTML==="24")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova14[i];

     }

  } 

  
  if(recPoRec.innerHTML==="25")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova15[i];

     }

  } 

  if(recPoRec.innerHTML==="26")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova16[i];

      }

  } 


  if(recPoRec.innerHTML==="27")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova17[i];

     }

  } 

  if(recPoRec.innerHTML==="28")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova18[i];

     }

  } 

if(recPoRec.innerHTML==="29")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova19[i];

     }

  } 

if(recPoRec.innerHTML==="30")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova20[i];

     }

  } 

if(recPoRec.innerHTML==="31")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova21[i];

     }

  } 

if(recPoRec.innerHTML==="32")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova22[i];

     }

  } 

if(recPoRec.innerHTML==="33")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova23[i];

     }

  } 

if(recPoRec.innerHTML==="34")  {

    for(let i=0; i < svaSlova.length; ++i)  {

   svaSlova[i].innerHTML=slova24[i];

     }

  } 

}


function stopiranjeSlagalice() {

   clearTimeout(prvaRunda25);
   clearInterval(drugaRunda5);

}

let stopSad;

function menjanjeKolona() {
	
drugaRunda5=setInterval(igraSlova2, 10);
stop2=setInterval(stopiranjeSlagalice, 1800);
covek.value="";
covek.readOnly=false;
kompjuter.value="";
stoperica.innerHTML=60;
covek.value="";
gramaticko.innerHTML="";
cifra.innerHTML=0;

for(let m=0; m < svaSlova.length; m++)  {

svaSlova[m].addEventListener("click", pronadjenoSlovo);
svaSlova[m].style.color="black";

  } 

function bojaStoperice() {

stoperica.style.background="turquoise";

}

function pocetakSlagalice() {
	
function krajSlagalice() {
	
stoperica.innerHTML -=1;

  if(stoperica.innerHTML < 10)  {

   $(stoperica).prepend(0);

    }

  if(stoperica.innerHTML < 1)  {
  
   clearInterval(stop1);
   covek.readOnly=true;
   algoritamKompjuteraSlagalica1();
   trecaRunda=setTimeout(kompVScovek, 1500);
   $("button").off("click");
   stopSad=setTimeout(bojaStoperice, 4000);

   for(let i=0; i < svaSlova.length; i++)  {

   svaSlova[i].removeEventListener("click", pronadjenoSlovo);

   } 

  }  

}

stop1=setInterval(krajSlagalice, 1000); 


}

stop3=setTimeout(pocetakSlagalice, 2000);

}

function algoritamKompjuteraSlagalica1() {
	
  
  if(recPoRec.innerHTML==="23")  {

  kompjuter.value="аутопсија";

  }

  if(recPoRec.innerHTML==="24")  {

  kompjuter.value="мукотрпан";

  }

  if(recPoRec.innerHTML==="25")  {

  kompjuter.value="селективност";

  }

  if(recPoRec.innerHTML==="26")  {

  kompjuter.value="невероватно";

  }

  if(recPoRec.innerHTML==="27")  {

  kompjuter.value="агрикултура";

  }


  if(recPoRec.innerHTML==="28")  {

  kompjuter.value="тероризам";

  }
  
 if(recPoRec.innerHTML==="29")  {

  kompjuter.value="индискретан";

  } 

if(recPoRec.innerHTML==="30")  {

  kompjuter.value="конкуренција";

  }

if(recPoRec.innerHTML==="31")  {

  kompjuter.value="нутритивност";

  }

if(recPoRec.innerHTML==="32")  {

  kompjuter.value="цицијашлук";

  }

if(recPoRec.innerHTML==="33")  {

  kompjuter.value="менструација";

  }

if(recPoRec.innerHTML==="34")  {

  kompjuter.value="романтизам";

  }

}

function kompVScovek() {

  ci=parseInt(covekovPotez.innerHTML);
  ai=parseInt(kompjuterovPotez.innerHTML);

 if(kompjuter.value.length >= covek.value.length) {

   kompjuterovPotez.innerHTML=ai+kompjuter.value.length;

    }  
   
 if(covek.value.length > 12)  {

  covekovPotez.innerHTML=ci+0;
  kompjuterovPotez.innerHTML=ai+kompjuter.value.length;

  }

  if(kompjuter.value.length < covek.value.length && covek.value.length <= 12) {
     
    covekovPotez.innerHTML=ci+covek.value.length;

    }  

}

}


igraPocinje();


let igranjeNoveIgre;
let naceta=document.querySelector(".restartIgrice");

function prenosIgre() {
  
if(naceta.style.background=="turquoise") {

igraPocinje();
$(".prvaIgra").css("visibility","visible");
$(".drugaIgra").css("visibility","hidden");
$(".trecaIgra").css("visibility","hidden");
$(".cetvrtaIgra").css("visibility","hidden");
$(".petaIgra").css("visibility","hidden");
$(".sestaIgra").css("visibility","hidden");
$(".konacanSkor").css("visibility","hidden");
$(".ljudskiIgrac").text(0);
$(".kompjuterskiIgrac").text(0);
$(".ponovoNule").text(0);
$(".vreme").css("background","#EA4335");
$(".vreme1").css("background","#EA4335");
$(".brojka200").css("background","#EA4335");
$(".alarm").css("background","coral");
$(".odbrojavanje").css("background","white");

  }


}

igranjeNoveIgre=setInterval(prenosIgre, 5000);